<!--#include virtual="/ssi/header.include" -->
<!--  Enter custom page information and styles here -->
  <title>Vorbis.com: часта задаваемыя пытанні</title>
</head>
<body>
<!--#include virtual="/common/xiphbar.include" -->

<!--#include virtual="/ssi/pagetop.include" -->
<!--  All your page content goes here  -->

<a name="top"></a>
  
<h2 style="margin-top: 0;"> Што гэта такое? </h2>
<ul>
  <li> <a href="#what" id="_what">Што такое Ogg Vorbis?</a> </li>
  <li> <a href="#names" id="_names">Што азначаюць усе назвы азначаюць?</a> </li>
  <li> <a href="#mean" id="_mean">Дзе імёны прыйшлі? Што азначае лагатып азначае?</a> </li>
  <li> <a href="#mimetype" id="_mimetype">Што такое тып змесціва MIME для Vorbis Ogg струмень?</a> </li>
  <li> <a href="#replace" id="_replace">Vorbis ці цалкам замяніць MP3, ці гэта проста дадатковы кодэк?</a> </li>
  <li> <a href="#artist" id="_artist">Я мастак. Чаму я павінен быць зацікаўлены?</a> </li>
  <li> <a href="#fan" id="_fan">Я меламан. Чаму я павінен быць зацікаўлены?</a> </li>
  <li> <a href="#dev" id="_dev">Я распрацоўнік. Чаму я павінен быць зацікаўлены?</a> </li>
  <li> <a href="#company" id="_company">Я бягу музычнага лэйбла. Чаму я павінен быць зацікаўлены?</a> </li>
</ul>
<h2> Ліцэнзаванне </h2>
<ul>
  <li> <a href="#flic" id="_flic">Што да ліцэнзаванні Vorbis фармат Ogg?</a> </li>
  <li> <a href="#slic" id="_slic">Што да ліцэнзаванні праграмнага забеспячэння ўключаны Vorbis Ogg?</a> </li>
  <li> <a href="#com" id="_com">Мы робім камерцыйны, зачыненымі зыходнымі кодамі. Ці магу я выкарыстоўваць Ogg Vorbis на ўсіх? Што ліцэнзаванні я павінен плаціць?</a> </li>
  <li> <a href="#sell" id="_sell">Ёсць ліцэнзійныя зборы ў распаўсюдзе, продажу ці струменевага мультымедыя ў фармаце Ogg Vorbis, як Ёсць у іншых фарматах, такіх як MP3?</a> </li>
  <li> <a href="#money" id="_money">Калі Ёсць няма ліцэнзійных збораў, як вы збіраецеся рабіць грошы ад фармату? Ці будзеце вы спаганяць плату пазней, пасля Vorbis становіцца папулярнай?</a> </li>
</ul>
<h2> Якасць гуку </h2>
<ul>
  <li> <a href="#lossy" id="_lossy">Я чуў, што Vorbis з'яўляецца "стратамі" кодэк. Што гэта значыць?</a> </li>
  <li> <a href="#sound" id="_sound">Ці Ogg Vorbis гучаць лепш, чым MP3?</a> </li>
  <li> <a href="#other" id="_other">Чаму Ogg Vorbis лепш, чым іншыя "Новыя MP3" кодэкі, якія даступныя?</a> </li>
  <li> <a href="#transcode" id="_transcode">Ці магу я канверсаваць MP3-калекцыю ў фармат Ogg Vorbis?</a> </li>
  <li> <a href="#test" id="_test">Вы, сцвярджаючы, што Vorbis мае пышная якасць гуку. Вы зрабілі нічога трансляцыя выпрабаванняў у падтрымку такога сцвярджэння?</a> </li>
  <li> <a href="#bugs" id="_bugs">Я чуў, некаторыя ўзоры, якія гукавыя артэфакты. Чаму гэта адбылося?</a> </li>
  <li> <a href="#quality" id="_quality">Што азначае "якасць" азначае?</a> </li>
  <li> <a href="#speech" id="_speech">Як Vorbis тарыф для сціску гаворкі?</a> </li>
</ul>
<h2> Асаблівасці </h2>
<ul>
  <li> <a href="#comments" id="_comments">Лі Ogg Vorbis ёсць магчымасць паказаць назву песні і імя выканаўца, калі файл прайграваецца ці струменевага?</a> </li>
  <li> <a href="#video" id="_video">Дзе відэа?</a> </li>
  <li> <a href="#stream" id="_stream">А як наконт струменевага ў фармаце Ogg Vorbis?</a> </li>
  <li> <a href="#support" id="_support">Якое праграмнае забеспячэнне і апаратную падтрымку Ogg Vorbis?</a> </li>
  <li> <a href="#container" id="_container">Ці магу я расслаенне Vorbis і іншы тып носьбіта (напрыклад, тэкст песні ці фатаграфіі) у тым жа файле?</a> </li>
</ul>
<h2> Развіцці </h2>
<ul>
  <li> <a href="#startdev" id="_startdev">Як пачаць працу з Vorbis Ogg развіцці?</a> </li>
  <li> <a href="#fpsupport" id="_fpsupport">Ці магчымы такі варыянт у порт дэкодар Vorbis / кадавальнік для платформы без падтрымкі плывучай кропкай?</a> </li>
</ul>
<h2> Мета-Пытанні і адказы </h2>
<ul>
  <li> <a href="#FAQmorequestions" id="_FAQmorequestions">У мяне ёсць пытанне на які няма адказу на гэты FAQ. Дзе я магу звярнуцца за дапамогай?</a> </li>
  <li> <a href="#FAQcontribute" id="_FAQcontribute">Дзе можна абмеркаванні і ўнёсак у гэты FAQ будзе зроблена?</a> </li>
  <li> <a href="#FAQcurrent" id="_FAQcurrent">Як ток гэтага FAQ?</a> </li>
</ul>
<hr/>
<h3> Што гэта такое? </h3>
<dl>
  <dt> <a href="#_what" id="what">Што такое Ogg Vorbis?</a> </dt>
  <dd>
    <p> Ogg Vorbis з'яўляецца новы фармат сціску аўдыё. Гэта прыкладна супастаўна з іншымі фарматамі, выкарыстоўванымі для захоўвання і прайграванні лічбавай музыкі, такімі як MP3, VQF, AAC і іншыя лічбавыя аўдыё фарматы. Ён адрозніваецца ад гэтых формаў, таму што гэта цалкам вольнымі, адкрытымі і непатентованных. </p>
  </dd>
  <dt> <a href="#_names" id="names">Што азначаюць усе назвы азначаюць?</a> </dt>
  <dd>
    <dl>
      <dt> <dfn>Ogg</dfn> </dt>
      <dd> Ogg гэта імя з Xiph.org кантэйнер для аўдыё, відэа і метададзеных. </dd>
      <dt> <dfn>Vorbis</dfn> </dt>
      <dd> Vorbis з'яўляецца імя пэўнага аўдыё схема сціску, якая была распрацавана, якая павінна ўтрымоўвацца ў Ogg. Звернеце ўвагу, што іншыя фарматы могуць быць убудаванымі ў Ogg, такія як <a href='http://flac.sourceforge.net/'>FLAC</a> і <a href='http://www.speex.org/'>Speex</a>. </dd>
    </dl>
    <p/>
  </dd>
  <dt> <a href="#_mean" id="mean">Дзе імёны прыйшлі? Што азначае лагатып азначае?</a> </dt>
  <dd>
    <p> <a href="http://www.xiph.org">Xiph.org</a> мае <a href="http://www.xiph.org/xiphname">старонцы</a> тлумачэнні крыніц і сэнс назваў і лагатыпаў. </p>
  </dd>
  <dt> <a href="#_mimetype" id="mimetype">Што такое тып змесціва MIME для Vorbis Ogg струмень?</a> </dt>
  <dd>
    <p> <code>application/ogg</code>. </p>
    <p> Афіцыйны MimeType быў зацверджаны ў лютым 2003 гады. Эксперыментальных <code>application/x-ogg</code> могуць па-ранейшаму там, хоць. </p>
  </dd>
  <dt> <a href="#_replace" id="replace">Vorbis ці цалкам замяніць MP3, ці гэта проста дадатковы кодэк?</a> </dt>
  <dd>
    <p> Ogg Vorbis быў распрацаваны, каб цалкам замяніць усе ўласныя, запатэнтаваныя аўдыё фарматы. Гэта азначае, што вы можаце закадаваць усю вашу музыку ці аўдыё кантэнт у Vorbis і ніколі не аглядацца назад. </p>
  </dd>
  <dt> <a href="#_artist" id="artist">Я мастак. Чаму я павінен быць зацікаўлены?</a> </dt>
  <dd>
    <p> Ёсць некалькі чыннікаў: </p>
    <ul>
      <li> Vorbis файлаў можа сціскаць у меншы памер файла і дагэтуль гучаць хораша; <strong>лепшы сціск Vorbis скароціць выдаткі</strong> і <strong>прапускную здольнасць</strong> трымаць вас ад ахвярай уласнай папулярнасці. </li>
      <li> стандартызаваны, Vorbis "лёгка рэдагаваць загаловак каментара падае прастора для вас крамзолі ўсякія нататкі пра сябе распаўсюджваць разам з музыкай, гэта дапамагае знайсці прыхільнікаў вы, ваш сайт, і дзе купіць вашы рэчы. </li>
      <li> Калі вы вырашыце прадаць сваю музыку ў фармаце MP3, Вы несяце адказнасць за аплату Фраўнгофера адсотак ад кожнага продажу, таму што вы выкарыстоўваеце свае патэнты. Vorbis з'яўляецца патэнт і без ліцэнзіі, так што вы ніколі не трэба будзе заплаціць любому, каб прадаваць, дарыць, ці струмень уласную музыку. </li>
    </ul>
    <p/>
  </dd>
  <dt> <a href="#_fan" id="fan">Я меламан. Чаму я павінен быць зацікаўлены?</a> </dt>
  <dd>
  <p> Таму што Vorbis забяспечвае высокая якасць для вас фармаце, каб слухаць музыку. </p>
  <ul>
  <li> Для дадзенага памеру файла, Vorbis гучыць лепш, чым MP3. Гэта азначае:
    <ul>
      <li> Вы можаце захоўваць вашу музычную калекцыю прыкладна на тым жа ўзроўні якасці, але гэта зойме менш месцы </li>
      <li> <strong>ці</strong> вы можаце мець вашай музычнай калекцыі займае прыкладна гэтулькі ж месцы, але гэта гучыць лепш. </li>
      <li> Vorbis ужо карыстаецца шырокай падтрымкай у аўдыё-праграмы і шматлікія лічбавыя партатыўныя прайгравальнікі падтрымліваюць яе. </li>
    </ul>
    </dd>
  <dt> <a href="#_dev" id="dev">Я распрацоўнік. Чаму я павінен быць зацікаўлены?</a> </dt>
  <dd>
    <p> Epic Games (стваральнікі Unreal Tournament, і. Інш.). Выкарыстоўвалі Vorbis у сваіх гульнях з тых часоў выпускае Unreal Tournament 2003 для сціску гульні музыку без гульні ліцэнзійныя зборы ў SAP прыбытак ад кожнай гульні прадаў. <strong>Vorbis эканоміць распрацоўнікам гроша, пазбягаючы патэнтава-ліцэнзійнай платы.</strong> </p>
    <p> Epic не самотны; іншых карыстачоў Vorbis складаюцца з: </p>
    <ul>
      <li> Crystal Dynamics (Soul Reaver 2, Blood Omen 2) </li>
      <li> Croteam (Serious Sam: The Second Encounter) </li>
      <li> Pyrogon (Candy Кранчер) </li>
      <li> PopCap Games (алхімія) </li>
      <li> EA Games (Гары Потар і таемны пакой) </li>
    </ul>
    <p> Зацікаўлены? Гледзіце наш <a href='http://www.xiph.org/vorbis/'>сайт распрацоўніка</a>. </p>
  </dd>
  <dt> <a href="#_company" id="company">Я бягу музычнага лэйбла. Чаму я павінен быць зацікаўлены?</a> </dt>
  <dd>
    <ul>
      <li> Vorbis "вольных кодараў і высокая якасць-да-файла стаўленне можа <em>мінімізаваць выдаткі прапускной здольнасці</em> і <strong>ухіленні</strong> выдаткаў на ліцэнзаванне сціску. </li>
      <li> Падумайце, прадуктовая крама, які падае бясплатныя ўзоры, вашы кліенты, хутчэй за ўсё, купіць ваш прадукт, калі ён добра прадстаўлены. Затым вы можаце паказаць вашым патэнцыйным кліентам, што ваш палос <em>сапраўды</em> гучаць як з Ogg Vorbis. </li>
    </ul>
  </dd>
</dl>
<p> <a href="#top">Вярнуцца да пачатку</a> </p>
<hr/>
<h3> Ліцэнзаванне </h3>
<dl>
  <dt> <a href="#_flic" id="flic">Што да ліцэнзаванні Vorbis фармат Ogg?</a> </dt>
  <dd>
    <p> Спецыфікацыі Ogg Vorbis у грамадскі здабытак. Гэта абсалютна бясплатна для камерцыйнага ці некамерцыйнага выкарыстання. Гэта азначае, што камерцыйныя распрацоўнікі могуць самастойна напісаць Ogg Vorbis праграмнае забеспячэнне, якое сумяшчальна са спецыфікацыяй на бязвыплатнай аснове і без якіх-небудзь абмежаванняў. Аднак, пакеты праграм мы распрацавалі даступныя пад рознымі бясплатна з адкрытым зыходным кодам ліцэнзіі на праграмнае забеспячэнне з рознай надбаўкі і абмежаванні. </p>
  </dd>
  <dt> <a href="#_slic" id="slic">Што да ліцэнзаванні праграмнага забеспячэння ўключаны Vorbis Ogg?</a> </dt>
  <dd>
    <p> Большасць (але не ўсё) нашы ўтыліта выпускаецца ў адпаведнасці з умовамі <a href='http://www.gnu.org/copyleft/gpl.html'>ліцэнзіі GNU GPL</a>. Бібліятэкі і SDK, выпускаюцца пад нашымі <a href='http://www.xiph.org/licenses/bsd/'>BSD-падобнай ліцэнзіі</a>. </p>
    <p> Заўважым, што распрацоўнікі па-ранейшаму вольна выкарыстоўваць спецыфікацыі пісаць рэалізацыі Ogg Vorbis ліцэнзаваны ў адпаведнасці з іншымі ўмовамі. </p>
  </dd>
  <dt> <a href="#_com" id="com">Мы робім камерцыйны, зачыненымі зыходнымі кодамі. Ці магу я выкарыстоўваць Ogg Vorbis на ўсіх? Што ліцэнзаванні я павінен плаціць?</a> </dt>
  <dd>
    <p> Ізноў <strong>жа,</strong> Ёсць <strong>не ліцэнзійныя зборы <em style='text-transform: uppercase; font-style: normal;'>за</em> выкарыстанне Vorbis Ogg спецыфікацыі.</strong> Як камерцыйных распрацоўнікаў, вы можаце стварыць і прадаць (ці аддаць) адкрытым ці зачыненым зыходным кодам рэалізацыі кодараў Vorbis, дэкодары, ці іншыя прылады. Аднак, калі вы выкарыстоўваеце наша праграмнае забеспячэнне, а не пісьмовай незалежнага ажыццяўлення, Вы павінны выконваць умовы ліцэнзіі. Нашы бібліятэкі даступна ў адпаведнасці з <a href='http://www.xiph.org/licenses/bsd/'>нашай BSD-падобнай ліцэнзіі</a> і можа быць скарыстаны цалкам ці часткова зачыненымі прыкладанняў крыніца. </p>
  </dd>
  <dt> <a href="#_sell" id="sell">Ёсць ліцэнзійныя зборы ў распаўсюдзе, продажу ці струменевага мультымедыя ў фармаце Ogg Vorbis?</a> </dt>
  <dd>
    <p style="font-weight: bold;"> Колькасць </p>
  </dd>
  <dt> <a href="#_money" id="money">Калі Ёсць няма ліцэнзійных збораў, як вы збіраецеся рабіць грошы ад фармату? Ці будзеце вы спаганяць плату пазней, пасля Vorbis становіцца папулярнай?</a> </dt>
  <dd>
    <p> Перавагі патэнтавай-бясплатна, без ліцэнзіі фармаце пераважыць заклапочанасць зарабляць грошы прама з фармату. Фармат Vorbis заўсёды будзе бясплатна і ў грамадскі здабытак. Xiph.org вывучае розныя мадэлі фінансавання развіцця, некаторыя з якіх можа ўключаць ліцэнзаванне нявольнай Vorbis-праграм і бібліятэк для камерцыйных праектаў. Тым не менш, кодар і дэкодар спасылка заўсёды будзе адкрытага боку крыніцы і трэці заўсёды можа змяніць ці перавызначыць іх. </p>
  </dd>
</dl>
<p> <a href="#top">Вярнуцца да пачатку</a> </p>
<hr/>
<h3> Якасць гуку </h3>
<dl>
  <dt> <a href="#_lossy" id="lossy">Я чуў, што Vorbis з'яўляецца "стратамі" кодэк. Што гэта значыць?</a> </dt>
  <dd>
    <p> Ёсць два шырокіх класаў алгарытмаў сціску: </p>
    <dl>
      <dt> <dfn>са стратамі</dfn> </dt>
      <dd> алгарытмаў сціску стратамі <em>выдаліць</em> дадзеныя для таго, каб сціснуць яго лепш, чым, як правіла, магчыма. Прыклады ўключаюць <abbr>JPEG,</abbr> Vorbis і <abbr>MP3-сціск.</abbr> </dd>
      <dt> <dfn>без страт</dfn> </dt>
      <dd> Алгарытмы сціску без страт вырабіць сціснутых дадзеных, якія могуць быць расшыфраваны да высновы, што супадае з арыгіналам. Zip з'яўляецца агульнай агульнага прызначэння без страт фармат сціску, <a href="http://flac.sourceforge.net/">FLAC</a> з'яўляецца фармат без страт сціску, якая адмыслова прызначана для аўдыё. </dd>
    </dl>
    <p/>
  </dd>
  <dt> <a href="#_sound" id="sound">Ці Ogg Vorbis гучаць лепш, чым MP3?</a> </dt>
  <dd>
    <p> Так, вызначана. Натуральна, мы запрашаем вас да суддзі гэта для сябе, калі ласка, гл. нашу <a href='http://www.xiph.org/vorbis/listen.html'>Dare для параўнання</a> старонцы, прынамсі некаторыя з нашых трансляцыя ўзораў. </p>
  </dd>
  <dt> <a href="#_other" id="other">Чаму Ogg Vorbis лепш, чым іншыя "Новыя MP3" кодэкі, якія даступныя?</a> </dt>
  <dd>
    <p> Vorbis гучыць лепш. Vorbis з'яўляецца адкрытым, так што вы можаце выкарыстоўваць яго на вашай каханай платформе. Vorbis не мае абмежаванняў інтэлектуальнай уласнасці, каб атрымаць у шляхі. І Vorbis не проста спрабуюць здавацца лепш, ён спрабуе зрабіць штосьці прынцыпова лепш ва ўсіх спосабаў, якімі ён можа. </p>
  </dd>
  <dt> <a href="#_transcode" id="transcode">Ці магу я канверсаваць MP3-калекцыю ў фармат Ogg Vorbis?</a> </dt>
  <dd>
    <p> Вы можаце канверсаваць любы аўдыё фармат Ogg Vorbis. Аднак, канвертаванні з аднаго фармату са стратамі, як MP3, у іншы фармат са стратамі, як Vorbis, як правіла, дрэнная ідэя. MP3 і Vorbis кодараў дасягнення высокай ступені сціску ад выкідваючы часткі гукавога сігналу, што вы, верагодна, не будзе чуць. Аднак, MP3 і Vorbis кодэкі вельмі розныя, таму кожны з іх будзе выкідваць розныя часткі аўдыё, хоць, безумоўна, з'яўляецца некаторым перакрыццем. Пераўтварэнне MP3 у Vorbis уключае дэкадаванні MP3 файла зваротна ў несціснутым фармаце, як WAV, і рекомпрессии яго з дапамогай кадавальніка Ogg Vorbis. Дэкадаваць MP3 будзе адсутнічаць частках арыгінальны гук, MP3 кодар вырашылі адмовіцца. Кадавальніка Ogg Vorbis затым адкінуць іншых аўдыё кампанентаў, калі ён сціскае дадзеныя. У лепшым выпадку вынікам будзе файл Ogg, якая гучыць гэтак жа, як ваш арыгінальны MP3, але найболей верагодна, што атрыманы файл будзе гучаць горш, чым зыходны MP3. Ні ў якім разе вы атрымаеце файл, які гучыць лепш, чым арыгінал MP3. </p>
    <p> Бо шматлікія гульцы могуць гуляць музыку MP3 <em>і</em> Ogg файлах, няма ніякіх чыннікаў, што вы павінны мець, каб перайсці ўсе вашы файлы ў адзін фармат ці іншыя. Калі вы кахаеце Ogg Vorbis, то мы рэкамендуем вам выкарыстоўваць яго пры кадаванні ад арыгінала, без страт крыніц гуку (напрыклад, кампакт-дыскі). Пры кадаванні з арыгіналаў, вы выявіце, што вы можаце зрабіць Ogg файлах, якія менш ці больш высокай якасці (ці абодва), чым ваш MP3. </p>
    <p> (Калі вы павінны абсалютна неабходна пераўтварыць з MP3 у Ogg, Ёсць некалькі сцэнараў пераўтварэння даступна на <a href="http://freshmeat.net/search/?q=convert%20ogg%20mp3">Freshmeat</a>.) </p>
  </dd>
  <dt> <a href="#_test" id="test">Вы, сцвярджаючы, што Vorbis мае пышная якасць гуку. Вы зрабілі нічога трансляцыя выпрабаванняў у падтрымку такога сцвярджэння?</a> </dt>
  <dd>
    <p> Так. Пагледзіце на нашы <a href='http://www.xiph.org/vorbis/listen.html'>Dare для параўнання</a> старонцы. </p>
    <p> Акрамя таго, нямецкі часопіс c't апублікаваў вынікі <a hreflang='de' href='http://www.heise.de/newsticker/data/anw-08.09.02-000/'>выпрабаванняў трансляцыя</a> якога высвятлілася, што Vorbis гучыць лепш, чым MP3 пры ніжэйшых бітрэйтах / налады якасці (каля 64kbit/sec). </p>
  </dd>
  <dt> <a href="#_bugs" id="bugs">Я чуў, некаторыя ўзоры, якія гукавыя артэфакты. Чаму гэта адбылося?</a> </dt>
  <dd>
    <p> Хоць фармат Vorbis файлаў з'яўляецца стандартным, кодарам Vorbis зведаў некалькі бэта-і цыклаў папярэдняй тэставанні. Калі файлы, якія вы чулі былі закадаваны з выкарыстаннем раней версія кадавальніка, яны могуць утрымоўваць сур'ёзныя памылкі аўдыё якасці, якія ўжо былі выпраўлены. Паспрабуйце перакадаванні ад крыніцы гуку з дапамогай апошніх кадавальніка. Калі вы ўсё яшчэ думаеце, у вас ёсць памылка, якая вырабляе неабгрунтаваных артэфактаў, калі ласка, па электроннай пошце Vorbis-Dev спіс дэталяў. </p>
  </dd>
  <dt> <a href="#_quality" id="quality">Што азначае "якасць" азначае?</a> </dt>
  <dd>
    <p> якасць гуку Vorbis "не <em>лепш за ўсё вымяраецца</em> у кілабітах у секунду, але па шкале ад -1 да 10 завецца" якасць ". Гэта змена ў тэрміналогіі было выклікана налада зменнай бітрэйт алгарытм, які вырабляе лепшая якасць гуку для дадзенага сярэдняга бітрэйту, але якія не прытрымваюцца, як строга, што сярэднія ў якасці мішэні. </p>
    <p> Гэта новая шкала вымярэнняў не прывязаны да колькаснага характарыстыкі струменя, як бітрэйт, так што гэта даволі суб'ектыўны метрыкі, але забяспечвае больш стабільную аснову параўнанню з іншымі кодэкамі і адносна будучыня. Як Segher Boessenkool растлумачыў: "Пры абнаўленні да новай кодар Vorbis, а ты ўсё ж наладах якасці, вы атрымаеце файлы меншага памеру, якія гучаць аднолькава. Калі вы трымаеце ж намінальны бітрэйт, вы атрымаеце прыкладна такі ж памер файлаў, якія гучаць некалькі лепш. "Былога паводзіны мэта метрыкі якасці, таму кадоўку битпоток у наш час афіцыйна рэкамендуецца для ўсіх выглядаў, акрамя струменевага вяшчання праз прапускны здольнасці -крытычных злучэнняў. </p>
    <p> Пакуль, якасць 0 прыкладна эквівалентна 64 Кбіт / з сярэдняя, 5 прыкладна 160kbps, і 10 дае каля 400kbps. Большасць людзей, якія патрабуюць у вельмі-амаль-CD-якасць гуку кадавання на якасць 5 ці, без страт сувязь стэрэа, 6. Па змаўчанні якасць 3, якая прыкладна ў 110kbps дае меншы памер файла і значна лепш, чым пэўнасць. Mp3 сціск у 128 кбіт / з. </p>
    <p> Як заўсёды, калі вам трэба CD-якасць гуку, ні Vorbis, ні MP3 (ні любыя іншыя аўдыё кодэк са стратамі) можа забяспечыць <em>дакладнае</em> прайграванне, замест гэтага, разгледзець магчымасць выкарыстання аўдыё без страт схема сціску, як <a href='http://flac.sourceforge.net'>FLAC</a>. </p>
  </dd>
  <dt> <a href="#_speech" id="speech">Як Vorbis тарыф для сціску гаворкі?</a> </dt>
  <dd>
    <p> Ён добра працуе, але, як правіла, не з'яўляецца аптымальным рашэннем. Vorbis прызначаны для сціску музыкі і агульнага аўдыё мэты. Адмысловы кодэкі мэты можна дасягнуць значна большага сціску гаворкі, чым Vorbis. Vorbis таксама як правіла, маюць затрымкі, што з'яўляецца занадта высокім для тэлефаніі, сумеснага выкарыстання маўленчыя кодэкі. Чытайце <a href="http://www.speech.cs.cmu.edu/comp.speech/FAQ3.html">кадаванні гаворкі і сціскі FAQ</a> для больш падрабязнай інфармацыі. Тыя, хто шукае з адкрытым зыходным кодам, патэнтава-вольны маўленчы кодэк павінен зірнуць на <a href="http://www.speex.org/">Speex</a>. </p>
  </dd>
</dl>
<p> <a href="#top">Вярнуцца да пачатку</a> </p>
<hr/>
<h3> Асаблівасці </h3>
<dl>
  <dt> <a href="#_comments" id="comments">Лі Ogg Vorbis ёсць магчымасць паказаць назву песні і імя выканаўца, калі файл прайграваецца ці струменевага?</a> </dt>
  <dd>
    <p> Так, Vorbis складаецца з <a href="http://www.xiph.org/vorbis/doc/v-comment.html">гнуткае, поўнае поле каментар</a> для і Інфармацыя пра выканаўца песні, а таксама іншыя дадзеныя трэка. Афіцыйны кадавальнік, OggEnc, дазваляе ўвесці каментар інфармацыя на кадаванне часу. Іншыя прылады прылады таксама дазваляе ўводзіць і рэдагаваць адсочваць дадзеныя. </p>
  </dd>
  <dt> <a href="#_video" id="video">Дзе відэа?</a> </dt>
  <dd>
    <p> Калі вы зацікаўлены ў нашым пасоўванні на відэа кодэк, праверыць Theora на <a href='http://www.theora.org/'>theora.org</a>. </p>
  </dd>
  <dt> <a href="#_stream" id="stream">Што пра струменевы ў Ogg Vorbis?</a> </dt>
  <dd>
    <p> Ogg Vorbis лёгка струменевымі. <a href='http://www.icecast.org/'>Icecast</a>, наш сервер струменевага аўдыё, здольная струменевага Ogg Vorbis, каб гульцы, такія як <a href='http://xmms.org/'>XMMS</a>, <a href='http://classic.winamp.com/'>Winamp 2</a>, і <a href='http://www.foobar2000.org/'>foobar2000</a>. </p>
  </dd>
  <dt> <a href="#_support" id="support">Якое праграмнае забеспячэнне і апаратную падтрымку Ogg Vorbis?</a> </dt>
  <dd>
    <p> Шматлікія праграмы падтрымкі Ogg Vorbis кадаванні і прайграванні, ён уключаны ў папулярных гульцоў, такіх як <a href='http://www.winamp.com/'>Winamp</a> <a href='http://www.foobar2000.org/'>foobar2000</a> для Windows, і <a href='http://whamb.com'>Whamb</a> для OS X. Гэта таксама падтрымліваецца ў папулярныя аўдыё прыкладанні, такія як <a href='http://cdexos.sourceforge.net/'>CDex</a> і <a href='http://www.goldwave.com/'>GoldWave</a>. Для больш поўнага спісу, звернецеся да <a href="http://www.vorbis.com/download.psp">нашым праграмным забеспячэннем старонкі</a>. </p>
    <p> <a href='http://wiki.xiph.org/'>Наша Вікі</a> мае <a href="http://wiki.xiph.org/VorbisHardware">адзначае на апаратную падтрымку</a> для Vorbis. </p>
  </dd>
  <dt> <a href="#_container" id="container">Ці магу я расслаенне Vorbis і іншы тып носьбіта (напрыклад, тэкст песні ці фатаграфіі) у тым жа файле?</a> </dt>
  <dd>
    <p> Так. Кантэйнер фармаце Ogg быў распрацаваны, каб розныя тыпы носьбітаў для мультыплексаваных разам; <a href='http://www.theora.org/'>Theora</a> будуць змяшаны з Vorbis аўдыё ў кантэйнер Ogg для кадавання фільмаў. </p>
    <p> Акрамя таго, <a href='http://flac.sourceforge.net/'>FLAC</a> могуць быць укаранёныя ў Ogg і некаторых папярэдніх прац было зроблена, каб пакласці MNG і MIDI утрыманне ў Ogg файлах як well.Experimental код даступны ў <tt>OGG-прылад</tt> модуля ў <a href="http://www.xiph.org/cvs.html">сховішча CVS Xiph.org</a>. Праграмісты, якія працуюць на такіх пашырэнняў могуць абмяркоўваць праблемы і пытанні па <a href="http://www.xiph.org/ogg/vmail.html">Dev спіс рассылання-Vorbis</a>. </p>
  </dd>
</dl>
<p> <a href="#top">Вярнуцца да пачатку</a> </p>
<hr/>
<h3> Развіцці </h3>
<dl>
  <dt> <a href="#_startdev" id="startdev">Як пачаць працу з Vorbis Ogg развіцці?</a> </dt>
  <dd>
    <p> Важна спачатку азнаёміцца з бягучымі высілкамі ў вобласці развіцця. Лепшы спосаб для гэтага з'яўляюцца: </p>
    <ul>
      <li> Запампаваць і сабраць апошнюю распрацоўку кода з <a href="http://www.xiph.org/cvs.html">CVS рэпазітара Xiph.org</a>. Важныя модулі для развіцця Vorbis Ogg з'яўляюцца <tt>OGG, Vorbis, АТ,</tt> і <tt>Vorbis-прылад.</tt> Калі вы зацікаўлены ў працы па ўводзе іншых тыпаў СМІ ў Ogg файлах, <tt>OGG-прылады</tt> модуль таксама мае прыкладзе кода. </li>
      <li> Падпісацца на <a href="http://www.xiph.org/ogg/vmail.html">Vorbis карыстача і спісы рассылання распрацоўнікаў</a>. </li>
      <li> Пагаворыце з распрацоўнікамі ў IRC. Як правіла, яны вісяць вакол у # Vorbis на irc.freenode.net. Яны могуць распавесці вам больш пра тое, што праекты будуць цікавыя ў бягучы момант. </li>
    </ul>
    <p> Пасля таго як вы бачылі, што робяць іншыя, у вас будзе больш шанцаў знайсці праект для працы. </p>
  </dd>
  <dt> <a href="#_fpsupport" id="fpsupport">Ці магчымы такі варыянт у порт дэкодар Vorbis / кадавальнік для платформы без падтрымкі плывучай кропкай?</a> </dt>
  <dd>
    <p> Гэта было зроблена для дэкодара. </p>
    <p> <a href='http://www.xiph.org/vorbis/'>Тремор</a> з'яўляецца фіксаванай кропкай рэалізацыі дэкодара Vorbis падыходзіць для чыпаў знайсці на партатыўных прыладах. Аднак, з фіксаванай кропкай <em>EN</em> кодар не было напісана. </p>
  </dd>
</dl>
<p> <a href="#top">Вярнуцца да пачатку</a> </p>
<hr/>
<h3> Мета-Пытанні і адказы </h3>
<dl>
  <dt> <a href="#_FAQmorequestions" id="FAQmorequestions">У мяне ёсць пытанне на які няма адказу на гэты FAQ. Дзе я магу звярнуцца за дапамогай?</a> </dt>
  <dd>
    <p> Ёсць архівы спісаў рассылання для прапаганды, карыстач абмеркавання і развіцці на <a href="http://www.xiph.org/archives/">старонцы спісу рассылання Xiph.org</a>, а таксама # Vorbis на irc.freenode.net, канал IRC. </p>
  </dd>
  <dt> <a href="#_FAQcontribute" id="FAQcontribute">Дзе можна абмеркаванні і ўнёсак у гэты FAQ будзе зроблена?</a> </dt>
  <dd>
    <p> <a href="http://xiph.org/archives/">Xiph.org спіс рассылання старонцы</a> таксама мае падпіску дадзеныя і архівы Vorbis спіс рассылання. Унёскі і абмеркаванні вітаюцца там. </p>
  </dd>
  <dt> <a href="#_FAQcurrent" id="FAQcurrent">Як ток гэтага FAQ?</a> </dt>
  <dd>
    <p> Ён быў абноўлены 3 кастрычніка 2003 гады. </p>
  </dd>
</dl>
</div>

<hr/>

<!--#include virtual="/ssi/pagebottom.include" -->
