<!--#include virtual="/ssi/header.ru.include" -->
<!--  Enter custom page information and styles here -->

<title>FLAC</title>
<style type="text/css">
<!--
#navlink_ a {
	text-decoration: underline;
}
-->
</style>

<!--#include virtual="/ssi/xiphbar.include" -->
<!--#include virtual="/ssi/pagetop.ru.include" -->
<!--  All your page content goes here  -->
<CENTER><H2>FLAC: начало</H2></CENTER>

<H3>Статус</H3>

<P>26 января 2003: <B>FLAC 1.1.0</B></P>

<P>Вышла версия FLAC 1.1.0. Среди новых возможностей поддержка ReplayGain и списков разметки аудиодисков. Кроме того улучшено сжатие 24-битных файлов и добавлениа поддержка редактирования тегов в плагинах. Подробнее об этом на странице <A HREF="news.html">новостей</A>.</P>

<P>Обратите внимание на то, что был увеличен младший номер версии, а значит совместимость снизу вверх была нарушена (т.е. более ранние версии декодеров не смогут воспроизводить файлы, созданные более поздними версиями кодера). Это произошло из-за ошибки в декодерах в версиях до 1.0.4 включительно, из-за которой декодеры неправильно пропускали неизвестные блоки метаданных. Потоковый формат не изменился, поэтому обратная совместимость не нарушена. Это значит, что файл FLAC со списком разметки аудиодиска не будет декодироваться версиями до 1.1.0, в которой была исправлена упомянутая выше ошибка.</P>

<P>Если вы используете FLAC и у вас есть предоложения или патчи, пожалуйста, присодиняйтесь к <A HREF="http://sourceforge.net/mail/?group_id=13478">списку рассылки</A> или <A HREF="http://sourceforge.net/project/memberlist.php?group_id=13478">группе разработчиков</A>. Сообщить об ошибке можно <A HREF="http://sourceforge.net/bugs/?func=addbug&group_id=13478">здесь</A>.</P>

<H3>Что такое FLAC?</H3>

<P>FLAC - это аббревиатура от Free Lossless Audio Codec (свободный аудиокодек, сжимающий без потерь). Проект FLAC включает:</P>

<P><BLOCKQUOTE><UL>
	<LI>потоковый формат;</LI>
	<LI>базовые кодеры и декодеры в виде библиотек;</LI>
	<LI><B><TT>flac</TT></B>, утилиту командной строки, выполняющую сжатие и распаковку файлов .flac;</LI>
	<LI><B><TT>metaflac</TT></B>, утилиту командной строки для редактирования метаданных в файлах .flac;</LI>
	<LI>плагины для разных плейеров.</LI>

</UL></BLOCKQUOTE></P>

<P>"Свобода" означает, что спецификация потокового формата открыта для всех и может быть использована для любых целей (проект FLAC оставляет за собой право устанавливать спецификации и сертифицировать относящиеся к нему продукты на совместимость), а также то, что ни формат, ни один из реализованных методов кодирования/декодирования не запатентованы. Это также значит, что все исходные тексты доступны по лицензиям, обязывающим предоставлять исходные коды.</P>

<P>FLAC компилируется на множестве платформ: Unixes (Linux, *BSD, Solaris, OS X), Windows, BeOS и OS/2. Имеются системы сборки для autoconf/automake, MSVC, Watcom C и Project Builder.</P>

<P>Чтобы узнать больше о проекте FLAC, смотрите страницы <A HREF="features.html">характеристики</A>, <A HREF="documentation.html">документация</A> и <A HREF="format.html">формат</A>. Также приведено <A HREF="comparison.html">сравнение</A> кодеров, сжимающих без потерь, и список <A HREF="goals.html">целей</A>, стоящих перед участниками проекта.</P>


<H3>Файлы</H3>

<P>На <A HREF="download.html">этой</A> странице находятся ссылки на исходные тексты, а также скопилированные версии для различных операционных систем, кроме того их можно получить прямо на <A HREF="http://www.sourceforge.net/projects/flac/">SourceForge</A>.</P>


<H3>Документация</H3>

<P>Документация доступна в режиме онлайн и в дистрибутивах. Информация по установке и использованию <B><TT>flac</TT></B> и плагинов находится <A HREF="documentation.html">здесь</A>. Более детальная информация о формате FLAC и базовом кодере приведена на <A HREF="format.html">этой странице</A>.</P>


<H3>Регистрация id</H3>

<P>Если у вас есть приложение, использующее FLAC, и вы хотите, чтобы оно работало с добавляемыми в файл метаданными, зайдите на <A HREF="id.html">страницу</A> регистрации и зарезервируйте для него идентификатор.</P>

<!--#include virtual="/ssi/pagebottom.ru.include" -->